app/Controllers/Admin/CourseController.php

    public function store()
    {
        helper('slug');

        $title = $this->request->getVar('title');
        $slug = string_to_slug($title);

        $session = session();

        $model = new Course();
        $data = [
            'title'             => $this->request->getVar('title'),
            'slug'              => $slug,
            'description'       => $this->request->getVar('description'),
            'user_id'           => intval($session->get('id')),
        ];
        $model->save($data);
---
INSERT INTO `courses` (`title`, `slug`, `description`, `user_id`) VALUES ('fwefwefewfwefwe', 'fwefwefewfwefwe', 'fwefwefwefewf', 3)