app/Controllers/Admin/UserController.php

SELECT `users`.`name`, `users`.`username`, `users`.`id`, `users`.`user_type_id`, `user_types`.`name` as `user_type_name`
FROM `users`
JOIN `user_types` ON `users`.`user_type_id` = `user_types`.`id`
WHERE `user_type_id` != 3
---
    public function index()
    {
        $users = new User();

        $data["users"] =
            $users
            ->where('user_type_id != 3')
            ->join('user_types', 'users.user_type_id = user_types.id')
            ->select('users.name, users.username, users.id, users.user_type_id, user_types.name as user_type_name')
            ->findAll();

DELETE FROM `users`
WHERE `id` = 15
---
    public function destroy()
    {
        $model = new User();
        $model->where('id', (int) $_GET['id'])->delete();