app/Controllers/AuthController.php

SELECT `users`.`name`, `users`.`username`, `users`.`id`, `users`.`user_type_id`, `user_types`.`name` as `user_type_name`
FROM `users`
JOIN `user_types` ON `users`.`user_type_id` = `user_types`.`id`
WHERE `username` = 'admin'
AND `password` = 'password'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();

        $users = new User();

        $data =
            $users
            ->where('username', $this->request->getVar("username"))
            ->where('password', $this->request->getVar("password"))
            ->join('user_types', 'users.user_type_id = user_types.id')
            ->select('users.name, users.username, users.id, users.user_type_id, user_types.name as user_type_name')
            ->first();

INSERT INTO `users` (`name`, `username`, `password`, `user_type_id`) VALUES ('hhe', 'hhe', 'password', 1)
---
    public function registration()
    {
        // //include helper form
        // helper(['form']);
        // //set rules validation form
        // $rules = [
        //     'name'          => 'required|min_length[3]|max_length[20]',
        //     'email'         => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.user_email]',
        //     'password'      => 'required|min_length[6]|max_length[200]',
        //     'confpassword'  => 'matches[password]'
        // ];

        $model = new User();
        $data = [
            'name'     => $this->request->getVar('name'),
            'username'    => $this->request->getVar('username'),
            // 'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            'password' => $this->request->getVar('password'),
            'user_type_id' => $this->request->getVar('user_type') ? $this->request->getVar('user_type') : 1,
        ];
        $model->save($data);