app/Controllers/CourseController.php

SELECT `courses`.*, `users`.`name` as `created_by`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`user_id`
WHERE `slug` = 'mengenal-kata-kerja'
 LIMIT 1
SELECT *
FROM `questions`
WHERE `course_id` = 1
---
    public function show()
    {
        $course = new Course();

        $data["course"] =
            $course
            ->where('slug', $_GET["slug"])
            ->join('users', 'users.id = courses.user_id')
            ->select('courses.*, users.name as created_by')
            ->first();

        $questions = new Question();

        $data["questions"] =
            $questions
            ->where("course_id", intval($data["course"]["id"]))
            ->findAll();