app/Controllers/DashboardController.php

    public function index()
    {

        // buat object model $news
        $courses = new Course();

        /*
     siapkan data untuk dikirim ke view dengan nama $newses
     dan isi datanya dengan news yang sudah terbit
    */
        $data['courses'] = $courses->findAll();
---
SELECT *
FROM `courses`